Revit 2024 API
AccessLevel Enumeration
 Defines access levels to objects in the Extensible Storage framework.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Since: 2012
Syntax
C#
public enum AccessLevel
Visual Basic
Public Enumeration AccessLevel
Visual C++
public enum class AccessLevel
Members
Member name | Description
Public |  Anybody has access to the object.
Vendor |  Only object vendor has access to it.
Application |  Only application that created the object has access to it.
See Also
Autodesk.Revit.DB.ExtensibleStorage Namespace